terraform plan for staging: 
```
> terraform plan
module.epp.aws_iam_policy.read_write: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-write]
module.epp.aws_iam_group.developers: Refreshing state... [id=epp-staging-developers]
module.epp.aws_iam_role.read_write_role: Refreshing state... [id=epp-staging-s3-read-write]
module.epp.aws_s3_bucket.main_bucket: Refreshing state... [id=staging-elife-epp-data]
module.epp.aws_iam_group_policy_attachment.read-write-role-policy-attachment: Refreshing state... [id=epp-staging-developers-20230310150834863500000001]
module.epp.aws_iam_role_policy_attachment.read-write-role-policy-attachment: Refreshing state... [id=epp-staging-s3-read-write-20230224112400484900000001]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.epp.aws_iam_policy.biorxiv_transfers_elife_read_access will be created
  + resource "aws_iam_policy" "biorxiv_transfers_elife_read_access" {
      + arn         = (known after apply)
      + description = "EPP staging read access to biorxiv's transfers-elife bucket"
      + id          = (known after apply)
      + name        = "epp-staging-biorxiv-transfers-elife-read-access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:Get*",
                          + "s3:List*",
                          + "s3-object-lambda:Get*",
                          + "s3-object-lambda:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::transfers-elife",
                          + "arn:aws:s3:::transfers-elife/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
    }

  # module.epp.aws_iam_role.biorxiv_transfers_elife_role will be created
  + resource "aws_iam_role" "biorxiv_transfers_elife_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {}
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::512686554592:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "epp-staging-biorxiv-transfers-elife-access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
      + unique_id             = (known after apply)
    }

  # module.epp.aws_iam_role_policy_attachment.biorxiv_transfers_elife_role_read_access_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "biorxiv_transfers_elife_role_read_access_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "epp-staging-biorxiv-transfers-elife-access"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```